In [1]:
import pandas as pd 

import numpy as np 

import matplotlib.pyplot as plt 

import seaborn as sns

# Import Data Set

In [3]:
df_sales = pd.read_csv("zepto_sales.csv")

In [5]:
df_products = pd.read_csv("zepto_products.csv")

# Displaying Basic Information of Products Dataset

In [6]:
df_products.info()

<class 'pandas.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    38 non-null     int64
 1   product_name  38 non-null     str
 2   category      38 non-null     str
 3   base_price    38 non-null     float64
dtypes: float64(1), int64(1), str(2)
memory usage: 1.3 KB

In [7]:
df_products.describe()

       product_id  base_price
count   38.000000   38.000000
mean   119.500000  211.414474
std     11.113055  139.411328
min    101.000000   23.250000
25%    110.250000  105.307500
50%    119.500000  188.005000
75%    128.750000  290.127500
max    138.000000  531.370000

In [9]:
df_products.head()

   product_id product_name             category  base_price
0         101        Apple  Fruits & Vegetables      103.13
1         102       Banana  Fruits & Vegetables       23.25
2         103        Onion  Fruits & Vegetables       55.75
3         104       Potato  Fruits & Vegetables       49.02
4         105       Tomato  Fruits & Vegetables      115.74

In [11]:
df_products.tail()

    product_id   product_name       category  base_price
33         134       Handwash  Personal Care      390.59
34         135     Toothpaste  Personal Care      182.49
35         136       Soap Bar  Personal Care      243.21
36         137      Face Wash  Personal Care      340.29
37         138  Sanitary Pads  Personal Care      266.48

In [12]:
df_products.columns

Index(['product_id', 'product_name', 'category', 'base_price'], dtype='str')

In [19]:
df_products.isnull()

    product_id  product_name  category  base_price
0        False         False     False       False
1        False         False     False       False
2        False         False     False       False
3        False         False     False       False
4        False         False     False       False
5        False         False     False       False
6        False         False     False       False
7        False         False     False       False
8        False         False     False       False
9        False         False     False       False
10       False         False     False       False
11       False         False     False       False
12       False         False     False       False
13       False         False     False       False
14       False         False     False       False
15       False         False     False       False
16       False         False     False       False
17       False         False     False       False
18       False         False     False       False
19       False         False     False       False
20       False         False     False       False
21       False         False     False       False
22       False         False     False       False
23       False         False     False       False
24       False         False     False       False
25       False         False     False       False
26       False         False     False       False
27       False         False     False       False
28       False         False     False       False
29       False         False     False       False
30       False         False     False       False
31       False         False     False       False
32       False         False     False       False
33       False         False     False       False
34       False         False     False       False
35       False         False     False       False
36       False         False     False       False
37       False         False     False       False

# Displaying Basic information of Sales Dataset

In [13]:
df_sales.info()

<class 'pandas.DataFrame'>
RangeIndex: 220220 entries, 0 to 220219
Data columns (total 9 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   order_id            220220 non-null  int64
 1   order_date          220220 non-null  str
 2   product_id          220220 non-null  int64
 3   quantity            220220 non-null  int64
 4   city                219118 non-null  str
 5   delivery_status     219118 non-null  str
 6   customer_id         220220 non-null  int64
 7   delivery_time_mins  215817 non-null  float64
 8   total_amount        220220 non-null  float64
dtypes: float64(2), int64(4), str(3)
memory usage: 15.1 MB

In [14]:
df_sales.describe()

,order_id,product_id,quantity,customer_id,delivery_time_mins,total_amount
count,220220.000000,220220.000000,220220.000000,220220.000000,215817.000000,220220.000000
mean,152325.652429,119.214218,1.548633,60016.100023,26.006246,302.336515
std,30172.200347,12.097782,1.003054,5781.447441,10.670646,324.031767
min,100001.000000,101.000000,1.000000,50000.000000,8.000000,23.250000
25%,126144.000000,109.000000,1.000000,55019.000000,17.000000,82.460000
50%,152444.500000,118.000000,1.000000,60019.000000,26.000000,226.870000
75%,178447.250000,134.000000,2.000000,65020.000000,35.000000,390.590000
max,204476.000000,138.000000,5.000000,69999.000000,44.000000,2656.850000

In [15]:
df_sales.head()

,order_id,order_date,product_id,quantity,city,delivery_status,customer_id,delivery_time_mins,total_amount
0,151992,2024-02-08 00:38:00,135,1,Bangalore,Delivered,66921,28.0,182.49
1,109440,2024-05-31 15:49:00,102,1,Mumbai,Delivered,66646,38.0,23.25
2,126862,2024-01-17 23:41:00,110,1,Mumbai,Delivered,69586,12.0,60.43
3,167258,2024-11-12 09:42:00,121,3,Hyderabad,Delivered,66719,12.0,996.12
4,159614,2024-01-02 17:50:00,112,4,Bangalore,Delivered,50094,38.0,907.48

In [16]:
df_sales.tail()

,order_id,order_date,product_id,quantity,city,delivery_status,customer_id,delivery_time_mins,total_amount
220215,204348,2024-04-08 00:51:00,112,2,Mumbai,Delivered,53512,18.0,453.74
220216,139692,2024-04-14 13:19:00,135,1,Bangalore,Delivered,60871,13.0,182.49
220217,155920,2024-11-22 13:49:00,110,1,Bangalore,Delivered,66690,19.0,60.43
220218,100568,2024-07-13 22:50:00,129,1,Bangalore,Delivered,61300,14.0,531.37
220219,195258,2024-07-30 11:27:00,112,1,Delhi,Delivered,63759,15.0,226.87

In [17]:
df_sales.columns

Index(['order_id', 'order_date', 'product_id', 'quantity', 'city',
       'delivery_status', 'customer_id', 'delivery_time_mins', 'total_amount'],
      dtype='str')

In [18]:
df_sales.isnull()

,order_id,order_date,product_id,quantity,city,delivery_status,customer_id,delivery_time_mins,total_amount
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
220215,False,False,False,False,False,False,False,False,False
220216,False,False,False,False,False,False,False,False,False
220217,False,False,False,False,False,False,False,False,False
220218,False,False,False,False,False,False,False,False,False
220219,False,False,False,False,False,False,False,False,False

# Data Cleaning - Handling Duplicates and missing values

In [20]:
df_sales.isnull().sum()

order_id                 0
order_date               0
product_id               0
quantity                 0
city                  1102
delivery_status       1102
customer_id              0
delivery_time_mins    4403
total_amount             0
dtype: int64

In [22]:
df_products.isnull().sum()

product_id      0
product_name    0
category        0
base_price      0
dtype: int64

In [ ]:
# Handle null values in 'city' and 'delivery_status' by dropping rows
# Q.For the city and delivery_status columns, remove the records (rows) tha contain NaN values.
df_sales.dropna(subset=['city','delivery_status'],inplace = True)

In [24]:
df_sales[["city","delivery_status"]].isnull().sum()

city               0
delivery_status    0
dtype: int64

In [25]:
df_sales.isnull().sum()

order_id                 0
order_date               0
product_id               0
quantity                 0
city                     0
delivery_status          0
customer_id              0
delivery_time_mins    4346
total_amount             0
dtype: int64

In [40]:
# Handle null values in 'delivery_time_mins' by filling with the mean
# Q.For the delivery_time_mins column, fill missing values with the mean of the column.

df_sales["delivery_time_mins"]=df_sales["delivery_time_mins"].fillna(df_sales["delivery_time_mins"].mean())

In [ ]:
df_sales["delvery_time_mins"].isnull().sum()

np.int64(0)

In [42]:
df_sales.isnull().sum()

order_id              0
order_date            0
product_id            0
quantity              0
city                  0
delivery_status       0
customer_id           0
delivery_time_mins    0
total_amount          0
dtype: int64

In [43]:
# Check for duplicate records

df_sales.duplicated().sum()

np.int64(216)

In [44]:
# Remove duplicate records 

df_sales.drop_duplicates(inplace=True)

In [45]:
# Convert 'order_date' to datetime objects

df_sales["order_date"] = pd.to_datetime(df_sales["order_date"])

In [46]:
df_sales["order_date"]

0        2024-02-08 00:38:00
1        2024-05-31 15:49:00
2        2024-01-17 23:41:00
3        2024-11-12 09:42:00
4        2024-01-02 17:50:00
                 ...
220215   2024-04-08 00:51:00
220216   2024-04-14 13:19:00
220217   2024-11-22 13:49:00
220218   2024-07-13 22:50:00
220219   2024-07-30 11:27:00
Name: order_date, Length: 217806, dtype: datetime64[us]

# Data Analysis - Aggregations and Grouping

In [50]:
# min amount
min_amount = df_sales["total_amount"].min()
print(min_amount)

23.25

In [51]:
# max amount
max_amount = df_sales["total_amount"].max()
print(max_amount)

2656.85

In [53]:
# avg amount
avg_amount = df_sales["total_amount"].mean()
print(avg_amount)

302.3239065039531

In [57]:
# Top 5 products by total sales amount

top_5products = df_sales.groupby("product_id")["total_amount"].sum().sort_values(ascending = False).head(5)
print(top_5products)

product_id
134    11658720.91
112     7908234.46
135     6171994.29
129     4796676.99
131     4716913.11
Name: total_amount, dtype: float64

In [55]:
df_sales.columns

Index(['order_id', 'order_date', 'product_id', 'quantity', 'city',
       'delivery_status', 'customer_id', 'delivery_time_mins', 'total_amount'],
      dtype='str')

In [59]:
# Merge With Product Details to get Product Names.

top_products_name = top_5products.reset_index().merge(df_products,on='product_id')
print(top_products_name)

   product_id  total_amount   product_name              category  base_price
0         134   11658720.91       Handwash         Personal Care      390.59
1         112    7908234.46    Paneer 200g          Dairy & Eggs      226.87
2         135    6171994.29     Toothpaste         Personal Care      182.49
3         129    4796676.99  Detergent 1kg  Household Essentials      531.37
4         131    4716913.11   Toilet Paper  Household Essentials      513.21

In [61]:
# Total sales By City

total_sales = df_sales.groupby("city")["total_amount"].sum()
print(total_sales)

city
Ahmedabad     1362556.30
Bangalore    16385777.49
Chennai       2563667.49
Delhi         9937151.01
Hyderabad     5305224.53
Kolkata       2671042.99
Mumbai       23063075.50
Pune          4559465.47
Name: total_amount, dtype: float64

In [63]:
# Average Delivery Time by city
average_delivery_time = df_sales.groupby('city')['delivery_time_mins'].mean()
print(average_delivery_time)

city
Ahmedabad    26.170095
Bangalore    26.015561
Chennai      26.059007
Delhi        26.037475
Hyderabad    25.914055
Kolkata      26.089218
Mumbai       25.979052
Pune         26.040857
Name: delivery_time_mins, dtype: float64

In [ ]:
# Sales Trend over Time (monthly sales)

#creating month column
df_sales["month"] = df_sales['order_date'].dt.to_period('M')

#Group by
monthly_sales_trends = df_sales.groupby('month')['total_amount'].sum()
print(monthly_sales_trends)

month
2024-01    5593297.49
2024-02    5286182.10
2024-03    5569350.76
2024-04    5375568.99
2024-05    5574801.37
2024-06    5380702.74
2024-07    5523114.55
2024-08    5468629.63
2024-09    5386353.65
2024-10    5547622.90
2024-11    5451878.37
2024-12    5690458.23
Freq: M, Name: total_amount, dtype: float64

In [68]:
# sales By Product category

df_products.columns

Index(['product_id', 'product_name', 'category', 'base_price'], dtype='str')

In [70]:
sales_by_category = df_sales.merge(df_products, on="product_id")
sales_by_category = sales_by_category.groupby("category")["total_amount"].sum().sort_values(ascending=False)
print(sales_by_category)

category
Personal Care           23399215.51
Dairy & Eggs            12344371.12
Household Essentials    11975638.84
Munchies                 8083367.83
Beverages                6598799.13
Fruits & Vegetables      3446568.35
Name: total_amount, dtype: float64